src/СРМ/src/DataProcessors/ЗагрузкаЗадачИзФайла/ЗагрузкаЗадачИзФайла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаЗадачИзФайла</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗагружаемыеДанные</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактОбращения</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаТрудозатрат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаТрудозатратИсполнителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительскаяЗадача</name>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </attributes>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>DocumentRef.Спринт</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Срочность</name>
      <type>
        <types>CatalogRef.СрочностиЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/СРМ/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатратИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеФормат</name>
    <type>
      <types>EnumRef.ВариантыОформленияТекста</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗакрытия</name>
    <type>
      <types>CatalogRef.КатегорииЗакрытияЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Documents/Спринт/Спринт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Спринт</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/DataProcessors/ЗагрузкаЗадачИзФайла/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ЗагрузкаИзФайла");
	ТабДокумент.Вывести(Макет);
	
	Объект.Исполнитель = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	
	ПрочитатьНаСервере();
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПредварительныйПросмотр;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	Объект.ЗагружаемыеДанные.Очистить();
	
	Для НомерСтроки = 2 По ТабДокумент.ВысотаТаблицы Цикл
		
		НоваяСтрока = Объект.ЗагружаемыеДанные.Добавить();
		
		НоваяСтрока.Тема = СокрЛП(ТабДокумент.Область(НомерСтроки, 1).Текст);
		НоваяСтрока.Проект = Справочники.Проекты.НайтиПоНаименованию(СокрЛП(ТабДокумент.Область(НомерСтроки, 2).Текст), Истина);
		НоваяСтрока.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТабДокумент.Область(НомерСтроки, 3).Текст), Истина);
		НоваяСтрока.КонтактОбращения = Справочники.ФизическиеЛица.НайтиПоНаименованию(СокрЛП(ТабДокумент.Область(НомерСтроки, 4).Текст), Истина);
		НоваяСтрока.ОценкаТрудозатрат = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ТабДокумент.Область(НомерСтроки, 5).Текст));
		НоваяСтрока.ОценкаТрудозатратИсполнителя = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ТабДокумент.Область(НомерСтроки, 6).Текст));
		НоваяСтрока.РодительскаяЗадача = Документы.Задача.НайтиПоНомеру(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ТабДокумент.Область(НомерСтроки, 7).Текст)));
		НоваяСтрока.Спринт = СпринтПоНаименованию(СокрЛП(ТабДокумент.Область(НомерСтроки, 8).Текст));
		НоваяСтрока.СрокИсполнения = СтроковыеФункцииКлиентСервер.СтрокаВДату(СокрЛП(ТабДокумент.Область(НомерСтроки, 9).Текст));
		НоваяСтрока.Срочность = Справочники.СрочностиЗадач.НайтиПоНаименованию(СокрЛП(ТабДокумент.Область(НомерСтроки, 10).Текст), Истина);
		НоваяСтрока.Содержание = СокрЛП(ТабДокумент.Область(НомерСтроки, 11).Текст);
		Примечание = СокрЛП(ТабДокумент.Область(НомерСтроки, 12).Текст);
		Если ЗначениеЗаполнено(Примечание) Тогда
			НоваяСтрока.Содержание = НоваяСтрока.Содержание + " (" + Примечание + ")";
		КонецЕсли;
		
		// значения по умолчанию
		Если Не ЗначениеЗаполнено(НоваяСтрока.Проект) Тогда
			НоваяСтрока.Проект = Объект.Проект;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.Исполнитель) Тогда
			НоваяСтрока.Исполнитель = Объект.Исполнитель;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.КонтактОбращения) Тогда
			НоваяСтрока.КонтактОбращения = Объект.КонтактОбращения;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.РодительскаяЗадача) Тогда
			НоваяСтрока.РодительскаяЗадача = Объект.РодительскаяЗадача;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.Спринт) Тогда
			НоваяСтрока.Спринт = Объект.Спринт;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.Срочность) Тогда
			НоваяСтрока.Срочность = Объект.Срочность;	
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
	ПоказатьПредупреждение(,"Обработка завершена");
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		НачатьТранзакцию();
		
		МассивДанныхЗаполнения = ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ЗагружаемыеДанные.Выгрузить());
		
		Для Каждого ДанныеЗаполнения Из МассивДанныхЗаполнения Цикл
			
			ЗадачаОбъект = Документы.Задача.СоздатьДокумент();
			ЗадачаОбъект.Заполнить(ДанныеЗаполнения);

			ЗадачаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Причина = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(Причина);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СпринтПоНаименованию(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	Спринт.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Спринт КАК Спринт
	|ГДЕ
	|	Спринт.Наименование = &Наименование
	|	И НЕ Спринт.Завершен
	|	И НЕ Спринт.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 1 Тогда
		Возврат Рез[0].Ссылка;
	Иначе
		Возврат Документы.Спринт.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
